/******************************************************************************************
 * FileName     : 01._button_one_status
 * Description  : 버튼 한 개를 눌렀다 뗐다 해보기(시리얼 모니터로 출력)
 * Author       : 이인정
 * Created Date : 2021.05.28
 * Reference    : 
 * Modified     : 2021.06.02 : LIJ : 헤더 수정
 * Modified     : 2021.12.16 : LEH : 소스 크린징
******************************************************************************************/

int button_red = D6;                               // 빨강 버튼


void setup() {
  pinMode(button_red, INPUT);                      // 핀 모드 설정
  Serial.begin(115200);
}


void loop() {
  int button_red_status = digitalRead(button_red); // 빨강 버튼의 값을 저장

  // 버튼이 눌렸는지 체크 버튼이 눌리면 LOW 눌리지 않으면 HIGH
  if(button_red_status == LOW){  
    Serial.println("버튼이 눌림");
    }
  else{
    Serial.println("버튼이 눌리지 않음");
    }
    
  delay(100);                                      // 0.1초 대기
}

//=========================================================================================
//                                                    
// (주)한국공학기술연구원 http://et.ketri.re.kr       
//                                                    
//=========================================================================================
