/******************************************************************************************
 * FileName     : 01._buzzer
 * Description  : 부저를 이용하여 소리 내보기
 * Author       : 이인정
 * Created Date : 2021.06.18
 * Reference    : 
 * Modified     : 2021.06.18 : LIJ : 헤더 수정
 * Modified     : 2021.12.16 : LEH : 소스 크린징
******************************************************************************************/

int buzzer = D6 ;


void setup ()
{
  pinMode (buzzer, OUTPUT) ;          // 핀 모드 설정
}


void loop ()
{
  int i;
  for (i=0;i<80;i++)
  {                                   
    digitalWrite(buzzer, HIGH);       // 소리를 짧게 한 번 냄
    delay(1);
    digitalWrite(buzzer, LOW);
    delay(1);
  }
  delay(1000);
}

//=========================================================================================
//                                                    
// (주)한국공학기술연구원 http://et.ketri.re.kr       
//                                                    
//=========================================================================================
