/******************************************************************************************
 * FileName     : 01._variable_resistance_sensor
 * Description  : 가변저항 값 출력 해 보기
 * Author       : 이인정
 * Created Date : 2021.05.28
 * Reference    : 
 * Modified     : 2021.06.02 : LIJ : 헤더 수정
 * Modified     : 2021.12.16 : LEH : 소스 크린징
******************************************************************************************/

int sensor = A0;                          // 가변저항 센서


void setup() {
  Serial.begin(115200);                   // 통신속도
}


void loop() {
  int sensor_result = analogRead(sensor); // 가변저항 센서 값 저장
  Serial.println(sensor_result);          // 가변저항 센서 값 출력
}

//=========================================================================================
//                                                    
// (주)한국공학기술연구원 http://et.ketri.re.kr       
//                                                    
//=========================================================================================
