/******************************************************************************************
 * FileName     : 01._oled_print
 * Description  : OLED 모듈에 "HelloWorld" 출력 해보기
 * Author       : 이인정
 * Created Date : 2021.06.08
 * Reference    : 
 * Modified     : 2021.06.08 : LIJ : 헤더 수정
 * Modified     : 2021.12.16 : LEH : 소스 크린징
******************************************************************************************/

#include "oled_u8g2.h"
OLED_U8G2 oled;


void setup(){
  oled.setup();                  // OLED 통신핀 기능 설정
}

 
void loop(){
  oled.setLine(2,"HelloWorld");  // OLED 모듈에 HelloWorld 출력
  oled.display();
}

//=========================================================================================
//                                                    
// (주)한국공학기술연구원 http://et.ketri.re.kr       
//                                                    
//=========================================================================================
