/******************************************************************************************
 * FileName     : 01._force_sensitive_resister
 * Description  : 압력센서의 값을 출력 해보기
 * Author       : 이인정
 * Created Date : 2021.06.17
 * Reference    : 
 * Modified     : 2021.06.17 : LIJ : 헤더 수정
 * Modified     : 2021.12.16 : LEH : 소스 크린징
******************************************************************************************/

int sensor = A3;                             // 압력센서


void setup() {
  Serial.begin(115200);                      // 통신속도
}


void loop() {
 int sensor_result = analogRead(sensor);     // 압력센서의 값 읽어오기
 Serial.println(sensor_result);              // 값 출력하기
}

//=========================================================================================
//                                                    
// (주)한국공학기술연구원 http://et.ketri.re.kr       
//                                                    
//=========================================================================================
