/******************************************************************************************
 * FileName     : 01._touch_sensor
 * Description  : 터치센서의 값 출력 해보기
 * Author       : 이인정
 * Created Date : 2021.06.17
 * Reference    : 
 * Modified     : 2021.06.17 : LIJ : 헤더 수정
 * Modified     : 2021.12.16 : LEH : 소스 크린징
******************************************************************************************/

int touch_sensor = D6;                                  // 터치센서


void setup() {
  Serial.begin(115200);                                 // 통신속도
  pinMode(touch_sensor, INPUT);                         // 핀 모드 설정
}


void loop() {
  int touch_sensor_result = digitalRead(touch_sensor);  // 터치센서의 값을 저장
  
  Serial.println(touch_sensor_result);                  // 터치센서 값 출력
}

//=========================================================================================
//                                                    
// (주)한국공학기술연구원 http://et.ketri.re.kr       
//                                                    
//=========================================================================================
