/******************************************************************************************
 * FileName     : 01._photoresistor_sensoer
 * Description  : 조도센서 값 출력 해보기 
 * Author       : 이인정
 * Created Date : 2021.05.28
 * Reference    : 
 * Modified     : 2021.06.02 : LIJ : 헤더 수정
 * Modified     : 2021.12.16 : LEH : 소스 크린징
******************************************************************************************/

int sensor = A1;                             // 조도센서


void setup() {
  Serial.begin(115200);                      // 통신속도
}


void loop() {
  int sensor_result = analogRead(sensor);    // 센서가 측정한 값 저장
  Serial.println(sensor_result);             // 센서가 측정한 값 시리얼 모니터에 출력
  delay(200);                                // 0.2초 대기
}

//=========================================================================================
//                                                    
// (주)한국공학기술연구원 http://et.ketri.re.kr       
//                                                    
//=========================================================================================
